In [1]:
import pandas as pd
from sklearn.impute import SimpleImputer

In [2]:
job=pd.read_csv('JobSalary2.csv')
job

   S_No  Computer  Marketing  Engineer
0     1      84.0       55.0        75
1     2      90.0       53.0        70
2     3      63.0        NaN        88
3     4       NaN       50.0        77
4     5      63.0       41.0        89
5     6      75.0       54.0        85
6     7       NaN       51.0        96
7     8      77.0       64.0       105

In [3]:
print(job.median())
job.describe()

S_No          4.5
Computer     76.0
Marketing    53.0
Engineer     86.5
dtype: float64

          S_No   Computer  Marketing    Engineer
count  8.00000   6.000000   7.000000    8.000000
mean   4.50000  75.333333  52.571429   85.625000
std    2.44949  10.930081   6.852181   11.537981
min    1.00000  63.000000  41.000000   70.000000
25%    2.75000  66.000000  50.500000   76.500000
50%    4.50000  76.000000  53.000000   86.500000
75%    6.25000  82.250000  54.500000   90.750000
max    8.00000  90.000000  64.000000  105.000000

In [4]:
job.isnull().sum()

S_No         0
Computer     2
Marketing    1
Engineer     0
dtype: int64

# 1. Mean imputer

In [5]:
mean_imp=SimpleImputer( strategy='mean')

In [6]:
job_mean=pd.DataFrame(mean_imp.fit_transform(job))

In [7]:
job_mean.isnull().sum()

0    0
1    0
2    0
3    0
dtype: int64

In [8]:
job_mean

     0          1          2      3
0  1.0  84.000000  55.000000   75.0
1  2.0  90.000000  53.000000   70.0
2  3.0  63.000000  52.571429   88.0
3  4.0  75.333333  50.000000   77.0
4  5.0  63.000000  41.000000   89.0
5  6.0  75.000000  54.000000   85.0
6  7.0  75.333333  51.000000   96.0
7  8.0  77.000000  64.000000  105.0

# 2.Median imputer

In [9]:
median_imp=SimpleImputer(strategy='median')

In [10]:
job_median=pd.DataFrame(median_imp.fit_transform(job))

In [11]:
job_median.isnull().sum()

0    0
1    0
2    0
3    0
dtype: int64

In [12]:
job_median

     0     1     2      3
0  1.0  84.0  55.0   75.0
1  2.0  90.0  53.0   70.0
2  3.0  63.0  53.0   88.0
3  4.0  76.0  50.0   77.0
4  5.0  63.0  41.0   89.0
5  6.0  75.0  54.0   85.0
6  7.0  76.0  51.0   96.0
7  8.0  77.0  64.0  105.0